---
kind: method
id: M:Autodesk.Revit.DB.SymbolicCurveArray.#ctor
source: html/74ddc2d9-4fd7-71e9-ace7-d17e0b5f58f2.htm
---
# Autodesk.Revit.DB.SymbolicCurveArray.#ctor Method

Initializes a new instance of the SymbolicCurveArray class

## Syntax (C#)
```csharp
public SymbolicCurveArray()
```